# Лабораторная работа №12. Введение в Python

В данной работе вы освежите для себя синтаксис языка Python (ну или познакомитесь с ним)
Вам предстоит решить набор алгоритмических задач.

### Оформление решения
Решение каждой задачи оформляется в виде файла с расширением `.py`

Решение каждой задачи это генеральная функция или класс, которые принимают на вход данные и отдают результат. 

**Ввод и вывод данных в консоль или файл производится вне функции!!!**  
*Если только вы не пишите функцию, предназначенную именно для этого*
___________________________________________________
###  Пример решения
<details>
<summary>👇👇👇</summary>

**Описание задачи:**  
Вы обслуживаете сайт и отслеживаете возникающие проблемы.  
Клиент получил ошибку после того, как попытался добавить свой 
пост в систему. 
Вы хотите понять, на каком из серверов эта ошибка произошла.

Есть $n$ серверов, на $i$-й из них приходится $a_i$ процентов запросов, из которых
$b_i$ процентов завершаются с ошибкой. 
Для каждого сервера найдите вероятность того, что ошибка произошла именно на нём.

**Формат входных данных**  
В первой строке входного файла содержится одно целое число $n(1 \leq n \leq 100)$ - количество серверов.
В каждой из следующих $n$ строк содержится два целых числа $a_i b_i (0 \leq a_i b_i \leq 100)$ — вероятность того, что запрос пойдёт на
**i**-й сервер, в процентах и вероятность того, что на
**i**-м сервере случится ошибка, в процентах.  
Гарантируется, что сумма всех $a_i$ равна 100, и ошибка в системе может произойти.

**Формат выходных данных**  
Выведите **n** строк. В каждой строке должно находиться одно вещественное число $(0 \leq p_i \leq 1)$ — вероятность, что ошибка произошла на соответствующем сервере.
Абсолютная или относительная погрешность каждого из ответов не должна превышать $10^{-9}$

**Примеры ввода и вывода:**  
<table>
<tr><th>Ввод</th><th>Вывод</th></tr>
<tr>
  <td>

```
2
50 1
50 2
```

</td>
  <td> 

```
0.333333333333
0.666666666667
```

  </td>
</tr>
<tr>
  <td>

```
3
10 100
30 10
60 2
```

  </td>
  <td>

```
0.704225352113
0.211267605634
0.084507042254
```

  </td>

</tr>
</table>

#### Образец Кода с решением
```python
import math
from typing import List


def calc_probabilty(prob: List[int]):
    """Функция расчёта вероятности возникновения ошибки на сервере"""
    result = [0.0] * len(prob)
    amount = sum(prob)
    for i in range(len(prob)):
        result[i] = prob[i] / amount
    return result


if __name__ == '__main__': # точка запуска вашего решения
    servers = int(input()) # ввод данных о количестве серверов
    probabilities = [
        math.prod(map(int, input().split())) for _ in range(servers)
    ] # расчёт относительных вероятностей для каждого сервера
    result = calc_probabilty(probabilities) # вызов функции для расчёта вероятности ошибки
    for probability in result:
        print(probability) # вывод результата
```
</details>

___________________________________________________

### [Ваше задание](task.md)

___________________________________________________
### Шпаргалка по Python

# Шпаргалка
_______________________________________________________________________
<details>
<summary>Основные типы данных</summary>


### Основные типы данных
Целочисленный тип
```python
int
int('12') # преобразует в число 12
```
Вещественные числа
```python
float
float('12.8') # преобразует в число 12.8
float(12) # преобразует в число 12.0
```
Строковые переменные
```python
str
str(12) # преобразует в строку '12'
str([1, 2, 3]) # преобразует в строку '[1, 2, 3]'
# в строку можно преобразовать почти всё
```
Булевые переменные
```python
bool
bool(12) # преобразует в True
12 == 12 # True
12 == 13 # False
str(0) # преобразует в False
``` 
</details>

_______________________________________________________________________
<details>

<summary>Коллекции</summary>

### Коллекции
Списки (__mutable__)
```python
list
data = list()
data = []
data = [1, 12.0, 'string', [2, 3], True, None]
data[0] # -> 1
data[-1] # -> None
data.append('element') # [1, 12.0, 'string', [2, 3], True, None, 'element']
``` 
Кортеж (__immutable__)
```python
tuple
data = tuple()
data = 1, 2, 'string', [2,3], True, None # (1, 2, 'string', [2, 3], True, None)
data[1] # -> 2
data[-2] # -> True
```
Словарь (хэш таблица) (__mutable__)
```python
dict
data = {}
data = {1: '1', 'string': 2, True: False, (4, 5): [8, 6], None: {1: 1, 2: '2'}}
data[1] # '1'
data['string'] # 2
data[None][1] # 1
```
Множество (__mutable__)
```python
set()
data = set()
data = set(
    (91, None, 'string', True, (1, 3))
)
# unordered
```
</details>

_______________________________________________________________________


<details>
<summary>Циклы</summary>

### Циклы
цикл с предусловием, в условии логическое выражение
```python
while True:
    print('infinity')
```
цикл поддерживающий протокол итерации
```python
result = 0
for i in range(10):
    result += i
# result = 45
```

</details>

_______________________________________________________________________

<details>
<summary>Функции</summary>

### Функции
```python
def function(arg1, arg2, *args, **kwargs):
    # arg1 - первый позиционный аргумент
    # arg2 - второй позиционный аргумент
    # *args - последующие позиционные аргументы преобразуются в кортеж
    # **kwargs - последующие именованные аргументы преобразуются в словарь
    result = f'{arg1} {arg2}'
    print(result)
    print(args) # tuple
    print(kwargs) # dict
    return result # возвращение результат работы
    
function('first', 2, 3, 4, 5, 6, a='key', b='value')
# first 2
# (3, 4, 5, 6)
# {'a': 'key', 'b': 'value'}
```
</details>

_______________________________________________________________________

<details>
<summary>Декорирование</summary>

### Декорирование

```python
# простой декоратор для функции с параметрами
def decorator(func):
    def wrapped(*args, **kwargs):
        print('I am decorated')
        return func(*args, **kwargs)
    return wrapped

@decorator
def my_func(first, second):
    print(first)
    print(second)

my_func(1, 2)

# I am decorated
# 1
# 2

# декоратор принимающий параметры
def decorator_with_args(my_arg):
    print("I am decorator with params", my_arg)
    def decorator(func):
        def wrapped(*args, **kwargs):
            print('I am decorated')
            return func(*args, **kwargs)
        return wrapped
    return decorator
```

</details>